Revit 2024 API
ParameterTypeId.DimStyleSuppressSpaces Property
 "Suppress Spaces"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DimStyleSuppressSpaces { get; }
Visual Basic
Public Shared ReadOnly Property DimStyleSuppressSpaces As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DimStyleSuppressSpaces {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace